---
kind: method
id: M:Autodesk.Revit.Creation.Application.NewGBXMLImportOptions
source: html/41a956c5-ec54-cfd8-cf76-843aea0fad6a.htm
---
# Autodesk.Revit.Creation.Application.NewGBXMLImportOptions Method

Creates Green-Building XML Import options.

## Syntax (C#)
```csharp
public GBXMLImportOptions NewGBXMLImportOptions()
```